1s/ERP/Conf/Documents/Лико_ОтчетФормщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ОтчетФормщика</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектНоменклатурыКоробка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_ОбъектыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектНоменклатурыОстатокОтКоробки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_ОбъектыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьЛиста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьФормИтог</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Comment>1 - отчет формщика, 2 - списание брака</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЛистовКСписанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзготовленныеФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаявкаНаФормы</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ТС_ЗаявкаНаРемонтРабочихЦентров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиЗаказа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Форма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Формы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьФормы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПолимера</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ВидыПолимеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Остатки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Длина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯССМ_ОбъектыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Enums/ЯС_ВидыШК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЯС_ВидыШК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ШК_Паллета</Name>
					<Comment>ЯС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Адреса</Name>
					<Comment>ЯС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Управляющий</Name>
					<Comment>ЯС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Коробки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Сотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Заказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_УпаковочныйЛист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ОбъектаНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ЗаявкаНаСклад</Name>
					<Comment>Старая</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_НомерБобины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_КодПродукта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_ИнформацияОПродукте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_УпотребитьДо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_НомерЗаказаКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_Roll_ID</Name>
					<Comment>Штрих-код EPSMA Roll ID короткий. (Правай часть от Roll Number)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SQL_Товароместо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_РабочегоЦентра</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SQL_ПриходРасходТовароместа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SQL_ТовароместоUID</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ЗаказаСпецификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Конверта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ОбъектаНоменклатуры_Короткий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Адреса_Короткий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_СотрудникаПолныйКод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ВходящихДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Растарки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Тара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_КартаСнятияПерерасхода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ТипоразмерПаллета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Паллета2_0</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ТС_СостоянияРемонтныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТС_СостоянияРемонтныхРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключенВПлан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятИзПлана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ОтчетФормщика/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ПодключаемоеОборудование
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	// Конец ПодключаемоеОборудование 
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Площадка = Лико_Дополнительно.ПлощадкаПользователяПоУмолчанию();
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо; 
		Объект.ВидДокумента = 1;
		Объект.РабочийЦентр = ПараметрыСеанса.Лико_РабочееМесто.ТСРабочийЦентр;
	КонецЕсли;
	
	ЗаполнитьВидПолимера();
	ПересчитатьИзменяющиесяПоказатели(Объект.ПлощадьФормИтог, Объект.ИзготовленныеФормы.НайтиСтроки(Новый Структура("Отметка", Истина)), КоэффициентРаскроя, Объект.ПлощадьЛиста, КоличествоОтмеченныхФорм);
	
	ТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	МенеджерОборудованияКлиентПереопределяемый.НачатьОтключениеОборудованиеПриЗакрытииФормы(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкода)
	
	ОчиститьСообщения();
	
	Результат = Лико_ДополнительноКлиент.ОбработатьШтрихКодНеТовара(ДанныеШтрихкода.Штрихкод);
	Если Результат.Ошибка <> "" Тогда
		Сообщить(Результат.Ошибка);
	Иначе
		Если Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Сотрудника") Тогда
			//Это физ. лицо
			Объект.Ответственный = Результат.Сотрудник;
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_РабочегоЦентра") Тогда
			Объект.РабочийЦентр = Результат.РабочийЦентр;
			РабочийЦентрПриИзмененииНаСервере();
		ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Ответственный не заполнен. Считайте свой пропуск",, "Ответственный");
			Возврат;
		ИначеЕсли НЕ ЗначениеЗаполнено(Объект.РабочийЦентр) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Рабочий центр не заполнен. Заполните вручную или считайте штрихкод рабочего центра",, "РабочийЦентр");
			Возврат;
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры_Короткий")
			ИЛИ Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры")
			Тогда
			Объект.ОбъектНоменклатурыКоробка = Результат.ОбъектНоменклатуры;
			ОбъектНоменклатурыКоробкаПриИзмененииНаСервере();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПоискПоШтрихкодуВыполнить(Команда)
	
	ОчиститьСообщения();
	Оповещение = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект);
	ШтрихкодированиеНоменклатурыКлиент.ПоказатьВводШтрихкода(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(ДанныеШтрихкода, ДополнительныеПараметры) Экспорт
	
	ОбработатьШтрихкоды(ДанныеШтрихкода);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектНоменклатурыКоробкаПриИзменении(Элемент)
	ОбъектНоменклатурыКоробкаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбъектНоменклатурыКоробкаПриИзмененииНаСервере(ПоискПоРодителю = Ложь)
	
	Объект.ПлощадьЛиста = 0;
	ВидПолимера = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(Объект.ОбъектНоменклатурыКоробка) Тогда
		Возврат;
	КонецЕсли;

	ЗначениеСвойстваПолимер = Справочники.Лико_ПредопределенныеЗначения.ЗначениеСвойстваПолимер.ЗначениеПараметра;
	ВидОснастки = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Объект.ОбъектНоменклатурыКоробка.Номенклатура, "ЗапчастиОснасткаВид_c52ae7cc4a5241f59cbbab22becfdcd8");
	Если ВидОснастки <> ЗначениеСвойстваПолимер Тогда
		Сообщить("Разрешено считывать только номенклатуру с видом оснастки """ + ЗначениеСвойстваПолимер + """ (вы считали """ + Объект.ОбъектНоменклатурыКоробка.Номенклатура + """ с видом """ + ВидОснастки + """)");
		Объект.ОбъектНоменклатурыКоробка = Неопределено;
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина); 
	
	ЗапросОстатки = Новый Запрос;
	ЗапросОстатки.Текст = Документы.Лико_ОтчетФормщика.ТекстЗапросаОстаткаКоробокСПризнакомДоступности();
	ЗапросОстатки.УстановитьПараметр("ЗначениеСвойстваПолимер", Справочники.Лико_ПредопределенныеЗначения.ЗначениеСвойстваПолимер.ЗначениеПараметра);
	ЗапросОстатки.УстановитьПараметр("Ячейка", Объект.РабочийЦентр.ЛикоЯчейка);
	Если ПоискПоРодителю Тогда 
		ЗапросОстатки.УстановитьПараметр("РодительОбъектаНоменклатуры", Объект.ОбъектНоменклатурыКоробка);
	Иначе
		ЗапросОстатки.УстановитьПараметр("РодительОбъектаНоменклатуры", Неопределено);
	КонецЕсли;
	
	ТзОстатки = ЗапросОстатки.Выполнить().Выгрузить();
	Если ПоискПоРодителю Тогда
		НайденныеСтроки = ТзОстатки;
	Иначе
		НайденныеСтроки = ТзОстатки.НайтиСтроки(Новый Структура("ОбъектНоменклатуры", Объект.ОбъектНоменклатурыКоробка));
	КонецЕсли;
	
	Если НайденныеСтроки.Количество() > 0 И ЗначениеЗаполнено(НайденныеСтроки[0].Количество) Тогда
		// Коробка найдена в остатках
		Если ПоискПоРодителю Тогда
			// Найдена коробка по родителю, заменим
			Объект.ОбъектНоменклатурыКоробка = НайденныеСтроки[0].ОбъектНоменклатуры;
		КонецЕсли; 
		
		// Проверим, что в остатках нет других открытых коробок с таким видом полимера 
		Если ЗначениеЗаполнено(НайденныеСтроки[0].ДругаяОткрытаяКоробка) Тогда
			Сообщить("Есть открытая коробка с видом полимера """ + НайденныеСтроки[0].ВидПолимера + """ размером " + НайденныеСтроки[0].Длина + "*" + НайденныеСтроки[0].Ширина + " (" + НайденныеСтроки[0].ДругаяОткрытаяКоробка + "). Сначала нужно израсходовать листы этой коробки");
			Объект.ОбъектНоменклатурыКоробка = Неопределено;
			Возврат;
		КонецЕсли;
		
		ВидПолимера = НайденныеСтроки[0].ВидПолимера;
		
		Если ЗначениеЗаполнено(НайденныеСтроки[0].ДлинаОстатка) И ЗначениеЗаполнено(НайденныеСтроки[0].ШиринаОстатка) Тогда 
			Объект.ПлощадьЛиста = НайденныеСтроки[0].ДлинаОстатка * НайденныеСтроки[0].ШиринаОстатка;
		Иначе
			Объект.ПлощадьЛиста = НайденныеСтроки[0].Длина * НайденныеСтроки[0].Ширина;
			Если Объект.ПлощадьЛиста = 0 Тогда
				Сообщить("В номенклатуре """ + НайденныеСтроки[0].Номенклатура + """ (" + НайденныеСтроки[0].Номенклатура.Код + ") не указана длина и/или ширина оснастки");
				Объект.ОбъектНоменклатурыКоробка = Неопределено;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли НЕ ПоискПоРодителю Тогда
		// Может быть считали ШК изначальной коробки. Попробуем найти открытую коробку по родителю
		ОбъектНоменклатурыКоробкаПриИзмененииНаСервере(Истина);
		Возврат;
	Иначе
		// Поищем серию по всему складу, чтобы сообщить, где она находится
		ЗапросПоЯчейкам = Новый Запрос;
		ЗапросПоЯчейкам.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка,
		|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыВЯчейкахОстатки.Серия КАК Серия,
		|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры,
		|	СУММА(ТоварыВЯчейкахОстатки.ВНаличииОстаток) КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки(, Серия = &Серия) КАК ТоварыВЯчейкахОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВЯчейкахОстатки.Ячейка,
		|	ТоварыВЯчейкахОстатки.Серия,
		|	ТоварыВЯчейкахОстатки.Номенклатура,
		|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры"; 
		
		ЗапросПоЯчейкам.УстановитьПараметр("Серия", Объект.ОбъектНоменклатурыКоробка.Серия);
		
		ВыборкаПоЯчейкам = ЗапросПоЯчейкам.Выполнить().Выбрать();
		Если ВыборкаПоЯчейкам.Следующий() И ЗначениеЗаполнено(ВыборкаПоЯчейкам.Количество) Тогда
			Сообщить("Объект номенклатуры """ + ВыборкаПоЯчейкам.ОбъектНоменклатурыКоробка + """ находится по адресу """ + ВыборкаПоЯчейкам.Ячейка + """");
			Объект.ОбъектНоменклатурыКоробка = Неопределено;
			Возврат;
		Иначе
			// Считанный ШК не найден
			Сообщить("Объект номенклатуры """ + Объект.ОбъектНоменклатурыКоробка + """ не найден в остатках");
			Объект.ОбъектНоменклатурыКоробка = Неопределено;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//ЗаполнитьВидПолимера();
	Если Объект.ВидДокумента = 1 Тогда
		ОбновитьФормыНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектНоменклатурыКоробкаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ОчиститьСообщения();
	СтандартнаяОбработка = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.РабочийЦентр) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Рабочий центр не заполнен. Заполните вручную или считайте штрихкод рабочего центра",, "РабочийЦентр");
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Документ.Лико_ОтчетФормщика.Форма.ФормаВыбораКоробок", Новый Структура("РабочийЦентр,ТекущаяКоробка", Объект.РабочийЦентр, Объект.ОбъектНоменклатурыКоробка), ЭтаФорма, ЭтаФорма,,,Новый ОписаниеОповещения("ЗакрытаФормаВыбораКоробки", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытаФормаВыбораКоробки(Результат, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Объект.ОбъектНоменклатурыКоробка = Результат;
		ОбъектНоменклатурыКоробкаПриИзмененииНаСервере();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФормы(Команда)
	ОбновитьФормыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьФормыНаСервере()

	Если НЕ ЗначениеЗаполнено(ВидПолимера) Тогда
		Сообщить("Выберите коробку, чтобы определить вид полимера");
		Возврат;
	КонецЕсли;
	
	СтрокиКУдалению = Объект.ИзготовленныеФормы.НайтиСтроки(Новый Структура("Отметка", Ложь));
	Для каждого ТекСтрокаКУдалению из СтрокиКУдалению Цикл
		Объект.ИзготовленныеФормы.Удалить(ТекСтрокаКУдалению);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТС_ЗаявкаНаРемонтРабочихЦентровЦвета.Ссылка КАК ЗаявкаНаФормы,
		|	ТС_ЗаявкаНаРемонтРабочихЦентров.ЗаказКлиента КАК ЗаказКлиента,
		|	ТС_ЗаявкаНаРемонтРабочихЦентровЦвета.КлючСтрокиЗаказа КАК КлючСтрокиЗаказа
		|ПОМЕСТИТЬ ВТ_ЗаявкиНаФормы
		|ИЗ
		|	Документ.ТС_ЗаявкаНаРемонтРабочихЦентров КАК ТС_ЗаявкаНаРемонтРабочихЦентров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТС_ЗаявкаНаРемонтРабочихЦентров.Цвета КАК ТС_ЗаявкаНаРемонтРабочихЦентровЦвета
		|		ПО ТС_ЗаявкаНаРемонтРабочихЦентров.Ссылка = ТС_ЗаявкаНаРемонтРабочихЦентровЦвета.Ссылка
		|			И (ТС_ЗаявкаНаРемонтРабочихЦентровЦвета.Состояние <> ЗНАЧЕНИЕ(Перечисление.ТС_СостоянияРемонтныхРабот.Выполнен))
		|			И (НЕ ТС_ЗаявкаНаРемонтРабочихЦентровЦвета.Отменить)
		|ГДЕ
		|	ТС_ЗаявкаНаРемонтРабочихЦентров.ПодразделениеПолучатель = ЗНАЧЕНИЕ(Справочник.ТС_Подразделения.Формщики)
		|	И ТС_ЗаявкаНаРемонтРабочихЦентров.ТекущееСостояние В (ЗНАЧЕНИЕ(Перечисление.ТС_СостоянияРемонтныхРабот.ВРаботе), ЗНАЧЕНИЕ(Перечисление.ТС_СостоянияРемонтныхРабот.ВключенВПлан), ЗНАЧЕНИЕ(Перечисление.ТС_СостоянияРемонтныхРабот.Подтвержден))
		|	И НЕ ТС_ЗаявкаНаРемонтРабочихЦентров.ПометкаУдаления
		|	И ТС_ЗаявкаНаРемонтРабочихЦентров.Проведен
		|	И ТС_ЗаявкаНаРемонтРабочихЦентров.СогласованоСБригадиром
		|	И ТС_ЗаявкаНаРемонтРабочихЦентров.Площадка = &Площадка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаявкиНаФормы.ЗаявкаНаФормы КАК ЗаявкаНаФормы,
		|	ВТ_ЗаявкиНаФормы.ЗаказКлиента КАК ЗаказКлиента,
		|	ВТ_ЗаявкиНаФормы.КлючСтрокиЗаказа КАК КлючСтрокиЗаказа,
		|	ЗаказКлиентаЦвета.Форма КАК Форма,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаЦвета.Форма.ВидПолимера = ЗНАЧЕНИЕ(Справочник.Лико_ВидыПолимеров.ПустаяСсылка)
		|				ИЛИ ЗаказКлиентаЦвета.Форма.ВидПолимера ЕСТЬ NULL
		|			ТОГДА ЗаказКлиентаЦвета.Форма.ВидПолимера
		|		ИНАЧЕ ЗаказКлиентаЦвета.Форма.ВидПолимера
		|	КОНЕЦ КАК ВидПолимера,
		|	ВТ_ЗаявкиНаФормы.ЗаказКлиента.ПлощадьКлише КАК ПлощадьФормы
		|ИЗ
		|	ВТ_ЗаявкиНаФормы КАК ВТ_ЗаявкиНаФормы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
		|		ПО ВТ_ЗаявкиНаФормы.ЗаказКлиента = ЗаказКлиентаЦвета.Ссылка
		|			И ВТ_ЗаявкиНаФормы.КлючСтрокиЗаказа = ЗаказКлиентаЦвета.КлючСтроки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаявкаНаФормы,
		|	Форма";

	Запрос.УстановитьПараметр("Площадка", Объект.Площадка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
		
	Пока Выборка.Следующий() Цикл
		Если ВидПолимера <> Выборка.ВидПолимера Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураОтбора = Новый Структура("ЗаявкаНаФормы,КлючСтрокиЗаказа");
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, Выборка);
		НайденныеСтроки = Объект.ИзготовленныеФормы.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(НайденныеСтроки[0], Выборка);
		Иначе
			ЗаполнитьЗначенияСвойств(Объект.ИзготовленныеФормы.Добавить(), Выборка);
		КонецЕсли;
	КонецЦикла;  
	
	ПересчитатьИзменяющиесяПоказатели(Объект.ПлощадьФормИтог, Объект.ИзготовленныеФормы.НайтиСтроки(Новый Структура("Отметка", Истина)), КоэффициентРаскроя, Объект.ПлощадьЛиста, КоличествоОтмеченныхФорм);
	
КонецПроцедуры

&НаСервере
Процедура РабочийЦентрПриИзмененииНаСервере()
	Объект.Площадка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РабочийЦентр, "Лико_Площадка");
КонецПроцедуры

&НаКлиенте
Процедура РабочийЦентрПриИзменении(Элемент)
	РабочийЦентрПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидПолимера()

	Если ЗначениеЗаполнено(Объект.ОбъектНоменклатурыКоробка) Тогда
		ВидПолимера = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Объект.ОбъектНоменклатурыКоробка.Номенклатура, "Лико_ВидПолимера"); 
	Иначе
		ВидПолимера = Неопределено;
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиентеНаСервереБезКонтекста
Функция ПересчитатьИзменяющиесяПоказатели(ПлощадьФормИтог, МассивОтмеченныхСтрок, КоэффициентРаскроя, ПлощадьЛиста, КоличествоОтмеченныхФорм)
	
	ПлощадьФормИтог = 0;
	Для каждого ТекСтрока из МассивОтмеченныхСтрок Цикл
		ПлощадьФормИтог = ПлощадьФормИтог + ТекСтрока.ПлощадьФормы;
	КонецЦикла;
	
	Если ПлощадьЛиста = 0 Тогда
		КоэффициентРаскроя = 0;
	Иначе
		КоэффициентРаскроя = ПлощадьФормИтог / ПлощадьЛиста * 100;
	КонецЕсли;
	
	КоличествоОтмеченныхФорм = МассивОтмеченныхСтрок.Количество();
	
КонецФункции

&НаКлиенте
Процедура ИзготовленныеФормыПриИзменении(Элемент)
	ПересчитатьИзменяющиесяПоказатели(Объект.ПлощадьФормИтог, Объект.ИзготовленныеФормы.НайтиСтроки(Новый Структура("Отметка", Истина)), КоэффициентРаскроя, Объект.ПлощадьЛиста, КоличествоОтмеченныхФорм);
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиФормы()

	Элементы.ГруппаОстатокРазмеры.Видимость = Объект.Остаток; 
	Элементы.ИзготовленныеФормы.Доступность = Объект.ВидДокумента = 1; 
	Элементы.КоэффициентРаскроя.Видимость = Объект.ВидДокумента = 1;
	Элементы.КоличествоЛистовКСписанию.Видимость = Объект.ВидДокумента = 2;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстатокПриИзменении(Элемент)
	
	Если Объект.Остаток Тогда
		Объект.Остатки.Добавить();
	Иначе
		Объект.Остатки.Очистить();
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если КоэффициентРаскроя > 95 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Коэффициент раскроя не может быть больше 95%",, "КоэффициентРаскроя");
			Отказ = Истина;
		КонецЕсли;   
		Для каждого ТекСтрока из Объект.ИзготовленныеФормы Цикл
			Если ТекСтрока.ВидПолимера <> ВидПолимера Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю("В строке №" + ТекСтрока.НомерСтроки + " вид полимера не соответствует выбранной коробке полимера",, "Объект.ИзготовленныеФормы[" + Объект.ИзготовленныеФормы.Индекс(ТекСтрока) + "].Отметка");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		Если Объект.Остаток Тогда
			Для каждого ТекСтрокаОстатка из Объект.Остатки Цикл
				Если ТекСтрокаОстатка.Длина < 45
					ИЛИ ТекСтрокаОстатка.Ширина < 45
					ИЛИ (ТекСтрокаОстатка.Длина >= 45 И ТекСтрокаОстатка.Длина < 65 И ТекСтрокаОстатка.Ширина < 65)
					ИЛИ (ТекСтрокаОстатка.Ширина >= 45 И ТекСтрокаОстатка.Ширина < 65 И ТекСтрокаОстатка.Длина < 65)
					Тогда
					ОбщегоНазначенияКлиент.СообщитьПользователю("Размер остатка должен быть больше 60см*45см по любой стороне",, "Остаток");
					Отказ = Истина;
				КонецЕсли;
			КонецЦикла;
			РазмерыЛистаКоробки = ПолучитьРазмерыЛистаКоробки(Объект.ОбъектНоменклатурыКоробка);
			Для каждого ТекСтрокаОстатка из Объект.Остатки Цикл  
				Если (ТекСтрокаОстатка.Длина > РазмерыЛистаКоробки.Длина И ТекСтрокаОстатка.Длина > РазмерыЛистаКоробки.Ширина)
					ИЛИ (ТекСтрокаОстатка.Ширина > РазмерыЛистаКоробки.Ширина И ТекСтрокаОстатка.Ширина > РазмерыЛистаКоробки.Длина)
					Тогда
					ОбщегоНазначенияКлиент.СообщитьПользователю("Размер остатка не может быть больше размера листа",, "Остаток");
					Отказ = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРазмерыЛистаКоробки(ОбъектНоменклатуры)
	РазмерыЛистаКоробки = Новый Структура("Длина,Ширина");
	Если ЗначениеЗаполнено(ОбъектНоменклатуры.Длина) И ЗначениеЗаполнено(ОбъектНоменклатуры.Ширина) Тогда
		РазмерыЛистаКоробки.Длина = ОбъектНоменклатуры.Длина;
		РазмерыЛистаКоробки.Ширина = ОбъектНоменклатуры.Ширина;
	Иначе
		РазмерыЛистаКоробки.Длина = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, ОбъектНоменклатуры.Номенклатура, "Лико_ДлинаОснастки", 0);
		РазмерыЛистаКоробки.Ширина = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, ОбъектНоменклатуры.Номенклатура, "Лико_ШиринаОснастки", 0); 
	КонецЕсли;
	Возврат РазмерыЛистаКоробки;
КонецФункции
	
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	Элементы.ТиповыеДокументы.Обновить();
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И Объект.ВидДокумента = 2 Тогда 
		ОтправитьПисьмоОСписанииБрака();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПисьмоОСписанииБрака()
	
	ТемаПисьма = 	"Списание брака на формном участке";
	ТекстПисьма = 	"Создан документ списания брака № " + Объект.Номер + "
					|Коробка """ + Объект.ОбъектНоменклатурыКоробка + """, количество листов - " + Объект.КоличествоЛистовКСписанию + " шт.";
	Если Объект.Остаток Тогда
		ТекстПисьма = ТекстПисьма + Символы.ПС + "Остатки:";
		Для каждого ТекСтрокаОстатка из Объект.Остатки Цикл
			ТекстПисьма = ТекстПисьма + Символы.ПС + ТекСтрокаОстатка.ОбъектНоменклатуры;
		КонецЦикла;
	КонецЕсли;
	
	ТекстПисьма = ТекстПисьма + Символы.ПС + "Комментарий: " + Объект.Комментарий;
	
	Адресаты = Новый СписокЗначений; 
	Адресаты.Добавить("IIvanov@okil-sato.ru");
	Адресаты.Добавить("vefimov@okil.ru");
	Лико_Планирование.ОтправитьПисьмо(ТекстПисьма, ТемаПисьма, Адресаты,, "textBody",,,, Ложь);
					
КонецПроцедуры

&НаКлиенте
Процедура ТиповыеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ТиповойДокумент) Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.ТиповойДокумент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)

	Если Объект.ВидДокумента = 1 Тогда
		Объект.КоличествоЛистовКСписанию = 0;
	Иначе
		Объект.КоличествоЛистовКСписанию = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("ОбъектНоменклатурыКоробка.БазоваяЕдиницаИзмерения.Числитель", Объект.ОбъектНоменклатурыКоробка, "ОбъектНоменклатурыКоробка");
		Объект.ИзготовленныеФормы.Очистить();
	КонецЕсли;
	УправлениеЭлементамиФормы();
	
КонецПроцедуры
